notes/linux-admin-note-2.org
#+title: 运维管理笔记二： 用户管理与硬盘挂载 
#+author: ziliang
#+date: Thu Mar 31 14:54:26 2022
#+email: 2273067585@qq.com 
#+latex_class: elegantpaper 


在[[file:install-cuda-in-server.org][上一篇]]笔记中我学会了如何为GPU硬件设置驱动和安装cuda，现在我又开始学习如何管理用户了。
*** 开账号

    开账号最简单的方式是用 =adduser= 而非 =useradd= 。

    直接一行命令： =adduser username= ,然后跟着提示走就可以了。
*** 修改账号的用户名

    #+BEGIN_SRC sh
      usermod -l newusername oldusername # 这一行用来修改用户名
      usermod -d /home/newusername -m newusername # 这一行用来修改home下面的旧文件名为新文件名
    #+END_SRC

最后，需要重启一下服务器以适应变化。
*** 数据备份
    然后服务器扩容，我负责备份。硬盘备份的主要方式如下：

    首先进入root进入，其实也不建议直接root进入。

    #+BEGIN_SRC sh
      sudo su
    #+END_SRC

    然后查看磁盘，使用 =sudo fdisk -l=

    一般而言硬盘的排序大概是sda, sdb, sdc, sdd这种，如果之前挂载的硬盘是sda，sdb这种，那么移动硬盘可能就会被
    分配为sdc或者sdd。可以根据其容量大小进行确认。比如我这边备份的移动硬盘为9.1T,发现是sdc。更进一步，可以发现
    还有sdc1和sdc2，这就是对这一块硬盘本身进行划分了。由于sdc2具有大部分的空间，所以下面需要把sdc2加载上。

    首先新建一个挂载的文件夹：

    #+BEGIN_SRC sh
      mkdir /mnt/dir_you_set
      mount /dev/sdc2 /mnt/dir_you_set
    #+END_SRC

    可以通过 =df -h= 去查看对应的过程。

    之后进行复制： =cp -r XXXXXXXXXXXX=

    卸载是使用下面的命令：

    #+BEGIN_SRC sh
      unmount /mnt/sdb2
    #+END_SRC

