linux-admin-note-2.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-04-27 周三 17:24 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>运维管理笔记二： 用户管理与硬盘挂载</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="ziliang" />
</head>
<body>
<div id="content">
<h1 class="title">运维管理笔记二： 用户管理与硬盘挂载</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgfc11be4">1. 开账号</a></li>
<li><a href="#orge792ee5">2. 修改账号的用户名</a></li>
<li><a href="#org004a282">3. 数据备份</a></li>
</ul>
</div>
</div>
<p>
在<a href="install-cuda-in-server.html">上一篇</a>笔记中我学会了如何为GPU硬件设置驱动和安装cuda，现在我又开始学习如何管理用户了。
</p>
<div id="outline-container-orgfc11be4" class="outline-2">
<h2 id="orgfc11be4"><span class="section-number-2">1</span> 开账号</h2>
<div class="outline-text-2" id="text-1">
<p>
开账号最简单的方式是用 <code>adduser</code> 而非 <code>useradd</code> 。
</p>

<p>
直接一行命令： <code>adduser username</code> ,然后跟着提示走就可以了。
</p>
</div>
</div>
<div id="outline-container-orge792ee5" class="outline-2">
<h2 id="orge792ee5"><span class="section-number-2">2</span> 修改账号的用户名</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-sh">usermod -l newusername oldusername <span style="color: #586e75;"># </span><span style="color: #586e75;">&#36825;&#19968;&#34892;&#29992;&#26469;&#20462;&#25913;&#29992;&#25143;&#21517;</span>
usermod -d /home/newusername -m newusername <span style="color: #586e75;"># </span><span style="color: #586e75;">&#36825;&#19968;&#34892;&#29992;&#26469;&#20462;&#25913;home&#19979;&#38754;&#30340;&#26087;&#25991;&#20214;&#21517;&#20026;&#26032;&#25991;&#20214;&#21517;</span>
</pre>
</div>

<p>
最后，需要重启一下服务器以适应变化。
</p>
</div>
</div>
<div id="outline-container-org004a282" class="outline-2">
<h2 id="org004a282"><span class="section-number-2">3</span> 数据备份</h2>
<div class="outline-text-2" id="text-3">
<p>
然后服务器扩容，我负责备份。硬盘备份的主要方式如下：
</p>

<p>
首先进入root进入，其实也不建议直接root进入。
</p>

<div class="org-src-container">
<pre class="src src-sh">sudo su
</pre>
</div>

<p>
然后查看磁盘，使用 <code>sudo fdisk -l</code>
</p>

<p>
一般而言硬盘的排序大概是sda, sdb, sdc, sdd这种，如果之前挂载的硬盘是sda，sdb这种，那么移动硬盘可能就会被
分配为sdc或者sdd。可以根据其容量大小进行确认。比如我这边备份的移动硬盘为9.1T,发现是sdc。更进一步，可以发现
还有sdc1和sdc2，这就是对这一块硬盘本身进行划分了。由于sdc2具有大部分的空间，所以下面需要把sdc2加载上。
</p>

<p>
首先新建一个挂载的文件夹：
</p>

<div class="org-src-container">
<pre class="src src-sh">mkdir /mnt/dir_you_set
mount /dev/sdc2 /mnt/dir_you_set
</pre>
</div>

<p>
可以通过 <code>df -h</code> 去查看对应的过程。
</p>

<p>
之后进行复制： <code>cp -r XXXXXXXXXXXX</code>
</p>

<p>
卸载是使用下面的命令：
</p>

<div class="org-src-container">
<pre class="src src-sh">unmount /mnt/sdb2
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: Thu Mar 31 14:54:26 2022</p>
<p class="author">Author: ziliang</p>
<p class="date">Created: 2022-04-27 周三 17:24</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
